app/Services/AuthService.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '2'
---
    public function user(): ?array
    {
        if ($this->user) { return $this->user; }
        $id = session()->get('uid');
        if (! $id) { return null; }
        $u = $this->users->find($id);