app/Services/MediaService.php

    public function getStats(): array
    {
        $totalStats = $this->media->select('COUNT(*) as count, SUM(size) as total_size')
                                 ->first();

        $mimeStats = $this->media->select('mime, COUNT(*) as count, SUM(size) as size')
                                ->groupBy('mime')
                                ->orderBy('size', 'DESC')
                                ->findAll();

        $scanStats = $this->media->select('scan_status, COUNT(*) as count')
                                ->groupBy('scan_status')
                                ->findAll();
---
SELECT COUNT(*) as count, SUM(size) as total_size
FROM `media`
WHERE `media`.`deleted_at` IS NULL
 LIMIT 1
SELECT `mime`, COUNT(*) as count, SUM(size) as size
FROM `media`
WHERE `media`.`deleted_at` IS NULL
GROUP BY `mime`
ORDER BY `size` DESC
SELECT `scan_status`, COUNT(*) as count
FROM `media`
WHERE `media`.`deleted_at` IS NULL
GROUP BY `scan_status`