app/Controllers/Admin/DashboardController.php

    private function getTotalUsers(): int
    {
        $userModel = new \App\Models\UserModel();
        return $userModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`

    private function getTotalMedia(): int
    {
        $mediaModel = new \App\Models\MediaModel();
        return $mediaModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `media`

    private function getRecentActivities(): array
    {
        $auditModel = new \App\Models\AuditLogModel();
        $activities = $auditModel->orderBy('created_at', 'DESC')
                                ->limit(10)
                                ->findAll();
---
SELECT *
FROM `audit_logs`
ORDER BY `created_at` DESC
 LIMIT 10