app/Controllers/Admin/RolesController.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Get roles with additional data
        $roles = $db->table('roles')
            ->select('roles.*,
                     (SELECT COUNT(*) FROM user_roles WHERE role_id = roles.id) as user_count,
                     (SELECT COUNT(*) FROM role_permissions WHERE role_id = roles.id) as permission_count')
            ->orderBy('roles.id', 'asc')
            ->get()
            ->getResultArray();

        // Get statistics
        $totalPermissions = $db->table('permissions')->countAllResults();
        $usersWithRoles = $db->table('user_roles')->distinct()->countAllResults('user_id');
        $allPermissions = $db->table('permissions')->select('id, slug, name, `group`')->get()->getResultArray();
---
SELECT `roles`.*, (SELECT COUNT(*) FROM user_roles WHERE role_id = roles.id) as user_count, (SELECT COUNT(*) FROM role_permissions WHERE role_id = roles.id) as permission_count
FROM `roles`
ORDER BY `roles`.`id` ASC
SELECT COUNT(*) AS `numrows`
FROM `permissions`
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT *
FROM `user_roles`
) CI_count_all_results
SELECT `id`, `slug`, `name`, `group`
FROM `permissions`

    public function permissions($roleId)
    {
        $guardResult = $this->guard('admin.roles.manage');
        if ($guardResult !== null) {
            return $guardResult;
        }

        $db = \Config\Database::connect();

        $role = $db->table('roles')->where('id', $roleId)->get()->getRowArray();
        if (!$role) {
            return $this->response->setStatusCode(404)->setJSON(['error' => 'Role not found']);
        }

        // Get all permissions grouped by category
        $allPermissions = $db->table('permissions')
            ->select('id, slug, name, `group`')
            ->orderBy('`group`', 'asc')
            ->orderBy('name', 'asc')
            ->get()
            ->getResultArray();

        // Get current role permissions
        $rolePermissions = $db->table('role_permissions')
            ->where('role_id', $roleId)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `roles`
WHERE `id` = '6'
SELECT `id`, `slug`, `name`, `group`
FROM `permissions`
ORDER BY `group` ASC, `name` ASC
SELECT *
FROM `role_permissions`
WHERE `role_id` = '6'

    public function users($roleId)
    {
        // Add guard check for consistency
        $guardResult = $this->guard('admin.roles.view');
        if ($guardResult !== null) {
            return $guardResult;
        }

        $db = \Config\Database::connect();

        $role = $db->table('roles')->where('id', $roleId)->get()->getRowArray();
        if (!$role) {
            return $this->response->setStatusCode(404)->setJSON(['error' => 'Role not found']);
        }

        // Get users with this role - fix the query to handle missing columns
        $users = $db->table('user_roles ur')
            ->select('u.id, u.username, u.email, u.created_at')
            ->join('users u', 'u.id = ur.user_id')
            ->where('ur.role_id', $roleId)
            ->orderBy('u.username', 'asc')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `roles`
WHERE `id` = '6'
SELECT `u`.`id`, `u`.`username`, `u`.`email`, `u`.`created_at`
FROM `user_roles` `ur`
JOIN `users` `u` ON `u`.`id` = `ur`.`user_id`
WHERE `ur`.`role_id` = '6'
ORDER BY `u`.`username` ASC

    public function getRoleData($id)
    {
        $db = \Config\Database::connect();

        $role = $db->table('roles')->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `roles`
WHERE `id` = '6'