app/Controllers/Admin/UsersController.php

    public function show($id)
    {
        if ($resp = $this->guardManage()) return $resp;

        $model = new \App\Models\UserModel();
        $user = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '8'

    public function update($id)
    {
        if ($resp = $this->guardManage()) return $resp;

        $model = new \App\Models\UserModel();
        $user = $model->find($id);

        if (!$user) {
            return $this->response->setJSON(['error' => 'User not found'])->setStatusCode(404);
        }

        $data = $this->request->getJSON(true) ?? $this->request->getPost();
        $updateData = [];

        // Update fields if provided
        if (isset($data['username'])) {
            $existingUser = $model->where('username', $data['username'])->where('id !=', $id)->first();
            if ($existingUser) {
                return $this->response->setJSON(['error' => 'Username already exists'])->setStatusCode(400);
            }
            $updateData['username'] = $data['username'];
        }

        if (isset($data['email'])) {
            $existingUser = $model->where('email', $data['email'])->where('id !=', $id)->first();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '8'
SELECT *
FROM `users`
WHERE `username` = 'tah@12345'
AND `id` != '8'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `users`
WHERE `email` = 'haodev1307+1@gmail.com'
AND `id` != '8'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    public function delete($id)
    {
        if ($resp = $this->guardManage()) return $resp;

        $model = new \App\Models\UserModel();
        $user = $model->find($id);

        if (!$user) {
            return $this->response->setJSON(['error' => 'User not found'])->setStatusCode(404);
        }

        // Prevent deleting own account
        if ((int)$id === (int)$this->auth->user()['id']) {
            return $this->response->setJSON(['error' => 'Cannot delete your own account'])->setStatusCode(400);
        }

        $model->delete($id);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '8'
UPDATE `users` SET `deleted_at` = '2025-08-12 01:14:14', `updated_at` = '2025-08-12 01:14:14'
WHERE `id` IN ('8')
AND `deleted_at` IS NULL

    public function toggle($id)
    {
        if ($resp = $this->guardManage()) return $resp;
        $model = new \App\Models\UserModel();
        $user = $model->find($id);
        if (! $user) return service('response')->setStatusCode(404);
        $new = ($user['status'] ?? 'active') === 'active' ? 'disabled' : 'active';
        $model->update($id, ['status'=>$new]);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '8'
UPDATE `users` SET `status` = 'disabled', `updated_at` = '2025-08-12 01:13:55'
WHERE `users`.`id` IN ('8')

    public function resetPassword($id)
    {
        if ($resp = $this->guardManage()) return $resp;
        $model = new \App\Models\UserModel();
        $user = $model->find($id);
        if (! $user) return service('response')->setStatusCode(404);
        $newPass = bin2hex(random_bytes(4));
        $model->update($id, ['password_hash'=>password_hash($newPass, PASSWORD_DEFAULT)]);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '8'
UPDATE `users` SET `password_hash` = '$2y$10$gfLVfVubmn89169S3jhslukEMWCyxnB489pdY3/njU5qFUH7.qTHC', `updated_at` = '2025-08-12 01:14:07'
WHERE `users`.`id` IN ('8')