app/Filters/TwoFactorFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $auth = service('auth');
        $user = $auth->user();
        if (!$user) {
            return service('response')->setStatusCode(401)->setJSON(['error'=>'Unauthenticated']);
        }
        $row = Database::connect()->table('user_twofactor')->where('user_id',$user['id'])->get()->getRowArray();
---
SELECT *
FROM `user_twofactor`
WHERE `user_id` = '2'